Revit 2024 API
DuctPressureDropData.HydraulicDiameter Property
 The hydraulic diameter of the duct. Units: (ft).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double HydraulicDiameter { get; set; }
Visual Basic
Public Property HydraulicDiameter As Double
	Get
	Set
Visual C++
public:
property double HydraulicDiameter {
	double get ();
	void set (double value);
}
See Also
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace